// Завдання No3. Введення числового значення
// Створіть функцію readNumber, яка вимагатиме введення числового значення до тих пір,
// поки відвідувач його не введе.
// Також треба дозволити користувачеві зупинити процес введення, відправивши порожній
// рядок або натиснувши "Скасувати". У цьому випадку функція повинна повернути null.

function readNumber() {
  let result = prompt("title");
  //   console.log(result);
  if (!result) {
    return null;
  }
  while (isNaN(result)) {
    result = prompt("Введіть число");
  }
}

console.log(readNumber());
