// Завдання No3. Введення числового значення
// Створіть функцію readNumber, яка вимагатиме введення числового значення до тих пір,
// поки відвідувач його не введе.
// Також треба дозволити користувачеві зупинити процес введення, відправивши порожній
// рядок або натиснувши "Скасувати". У цьому випадку функція повинна повернути null.

function readNumber() {
  let input = prompt("Введіть числове значення");
  //   console.log(result);
  if (!input) {
    return null;
  }
  while (isNaN(input)) {
    input = prompt("Все ж таки введіть число");
  }
}

console.log(readNumber());
