// Завдання No1. Створіть календар у вигляді таблиці
// Напишіть функцію createCalendar(elem, year, month).
// Виклик функції повинен створити календар для заданого місяця month на рік і вставити
// його в elem.
// Календар має бути таблицею, де тиждень – це <tr>, а день – це <td>. У таблиці має бути
// заголовок із назвами днів тижня, кожен день – <th>, першим днем тижня має бути
// понеділок.
// Наприклад, createCalendar(cal, 2012, 9) згенерує в cal наступний календар:

// PS У цьому завдання достатньо