// Завдання No11. Чи обов'язковий "else"?
// Наступна функція повертає true якщо параметр age більше 18.
// В іншому випадку вона запитує підтвердження через confirm і повертає його результат:
// function checkAge (age) {
// if (age > 18) {
// return true;
// } else {
// // ...
// return confirm( ' Батьки дозволили ?');
// }
// }
// Чи буде ця функція працювати якось інакше, якщо прибрати else ?
// function checkAge (age) {
// if (age > 18) {
// return true;
// }
// // ...
// return confirm( ' Батьки дозволили ?');
// }
// Чи є хоч одна відмінність у поведінці цього варіанту?

// Якщо брибрати else, функція працюватиме так само, різниці не буде. Блок if виконується,
//  якщо умова дорівнює true, тоді returt зупиняє подальше виконання.
// якщо умова не виконується, спрацьовує return confirm.
// Якби умов було більше, потрібно було б дабавити else if,
// але в такому разі зручніше використовувати оператор switch
