// Завдання No14. Функція pow( x, n )
// Напишіть функцію pow(x,n ), яка повертає x до ступеня n. Інакше кажучи, множить x на
// себе n разів і повертає результат.
// pow ( 3, 2) = 3 * 3 = 9
// pow ( 3, 3) = 3 * 3 * 3 = 27
// pow ( 1, 100) = 1 * 1 * ... * 1 = 1

// Створіть сторінку, яка запитує x та n, а потім виводить результат pow(x,n ).
// PS У цьому функція має підтримувати лише натуральні значення n, тобто. цілі від 1 та
// вище.
// **НЕ МОЖНА ВИКОРИСТОВУВАТИ СТАНДАРТНУ ФУНКЦІЮ ПРИВЕДЕННЯ ДО
// СТУПЕНЮ ТА ВІДПОВІДНИЙ ОПЕРАТОР

// function pow(x, n) {
//   let result = x;

//   for (let i = 1; i < n; i++) {
//     result *= x;
//   }
//   return result;
// }

// let x = prompt("x?", "");
// let n = prompt("n?", "");

// if (n < 1) {
//   alert(`Степінь ${n} не підтримується, використовуйте натуральне число`);
// } else {
//   alert(pow(x, n));
// }

// --------- or --------

function pow(x, n) {
  return x ** n;
}
console.log(pow(2, 3));
