// Завдання No 14. Обчислити факторіал
// Факторіал натурального числа – це число, помножене на себе мінус один, потім на себе
// мінус два, і так далі до 1. Факторіал n позначається як n!
// Визначення факторіалу можна записати як:

// n! = n * (n - 1) * (n - 2) * ... * 1

// Приклади значень для різних n:
// 1! = 1
// 2! = 2 * 1 = 2
// 3! = 3 * 2 * 1 = 6
// 4! = 4 * 3 * 2 * 1 = 24
// 5! = 5 * 4 * 3 * 2 * 1 = 120
// Завдання – написати функцію factorial(n), яка повертає n!, використовуючи рекурсію.
// alert( factorial(5) ); // 120
// PS Підказка: n! можна записати як n*(n-1)! Наприклад: 3! = 3 * 2! = 3 * 2 * 1! = 6

// 2
//3
function factorial(n) {
  let result = 1;
  if (n === 1 || n === 0) {
    return result;
  }

  result = n * factorial(n - 1);

  return result;
}
console.log(factorial(5));
