// Завдання No2. Створити повідомлення
// Напишіть функцію showNotification(options) , яка створює повідомлення: <div
// class="notification"> із заданим вмістом. Повідомлення має автоматично зникнути
// через 1,5 секунди.
// Приклад об'єкта options :
// // Показує елемент з текстом "Hello" поруч із правою верхньою частиною
// вікна.
// showNotification ({
// top : 10 , // 10px від верхньої межі вікна (за замовчуванням 0px)
// right : 10 , // 10px від правого краю вікна (за замовчуванням 0px)
// html : "Hello!" , // HTML-повідомлення
// className : "welcome" // Додатковий клас для div (необов'язково)
// });