// Завдання No2. Сусіди
// Якщо elem – довільний вузол DOM-елемента.
// • Правда, що elem.lastChild.nextSibling завжди дорівнює null ?
// • Правда, що elem.children[0].previousSibling завжди дорівнює null?

// так
// окрім випадка з пустим тегом - останньою дитиною,
// тоді lastChild поверне null,
// а lastChild.nextSibling поверне помилку доступу
//
// ні
// null повертається якщо вказаний вузел перший в свого батька.
// але elem.children[0] - елемент потомок, перед ним можуть буди текстові вузли
// може звернутися і до пробелу і поветнути text.
