// Завдання No12. Перепишіть функцію за допомогою оператора '?' або '||'

// Наступна функція повертає true якщо параметр age більше 18.
// В іншому випадку вона ставить питання confirm і повертає його результат.
// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm(" Батьки дозволили ?");
//   }
// }
// Перепишіть функцію, щоб вона робила те саме, але без if , в один рядок.
// Зробіть два варіанти функції checkAge:
// Використовуючи оператор?
// Використовуючи оператор ||

// function checkAge(age) {
//   return age > 18 ? true : confirm(" Батьки дозволили ?");
// }

function checkAge(age) {
  return age > 18 || confirm(" Батьки дозволили ?");
}

console.log(checkAge(19));
