// Завдання No8**. Пересуньте м'яч по полю
// Нехай м'яч переміщається при натисканні на поле, туди, куди був клік.
// Вимоги:
// Центр м'яча повинен збігатися з місцем натискання миші (якщо це можливо без
// перетину країв поля);
// CSS -анімація бажана, але не обов'язкова;
// М'яч у жодному разі не повинен перетинати межі поля;
// При прокручуванні сторінки нічого не повинно ламатися;
// Нотатки:
// Код повинен вміти працювати з різними розмірами м'яча та поля, не прив'язуватися до
// будь-яких фіксованих значень.
// Використовуйте властивості event.clientX / event.clientY для визначення координат миші
// при натисканні.
